[
  {
    "id": 1,
    "name": "Syahadat (Rukun Islam ke-1)",
    "arab": "شَهَادَةٌ",
    "task": "Rukun yang pertama adalah mengucapkan kalimat syahadat, yaitu:\n\nأشهد ان لا اله إلا الله و اشهد ان محمّد عبده رسوله\n\n“Saya bersaksi bahwa tidak ada sesembahan yang haq kecuali Allah dan saya bersaksi bahwa Muhammad adalah hamba dan rasulNya.”\n\nDua kalimat syahadat adalah kalimat yang sangat agung, merupakan kunci surga [HR. Muslim (149) dari Ubadah bin Shamit]. Syahadat adalah persaksian yang membedakan antara muslim dan kafir, barangsiapa mengucapkannya maka haram jiwa, harta, dan kehormatannya [‎Sebagaimana hadist Ibnu Umar, ‎Bukhari (25) dan Muslim (22)‎]."
  },
  {
    "id": 2,
    "name": "Shalat (Rukun Islam ke-2)",
    "arab": "الصَّلَاةُ وَالصَّلَوةُ",
    "task": "Shalat merupakan salah satu rukun Islam yang paling utama setelah syahadat. Di dalam Shalat berbagai macam ibadah terkumpul seperti, dzikrullah, bacaan al qur’an, berdiri, rukuk, sujud di hadapan Allah, berdo’a padaNya, tasbih, takbir dan lainnya. Shalat merupakan induk ibadah badaniyah. Tatkala Allah hendak menurunkan syariat shalat Dia memi’rajkan RasulNya ke langit [HR Bukhari (349), Muslim (162)], hal ini berbeda dengan syariat-syariat yang lain.\n\nSecara bahasa shalat artinya “do’a”. Sebagaimana firman Allah ta’ala,\n\nوَصَلِّ عَلَيْهِمْ إِنَّ صَلاَتَكَ سَكَنٌ لَّهُمْ وَاللّهُ سَمِيعٌ عَلِيمٌ\n\nDan mendo’alah untuk mereka. Sesungguhnya do’a kamu itu (menjadi) ketenteraman jiwa bagi mereka. Dan Allah Maha Mendengar lagi Maha Mengetahui. (QS. at Taubah: 103)"
  },
  {
    "id": 3,
    "name": "Zakat (Rukun Islam ke-3)",
    "arab": "الزَّكَاةُ",
    "task": "Rukun Islam berikutnya adalah zakat. Di dalam al Qur’an Allah menggandengkan‏ ‏antara‏ ‏shalat‏ ‏dan zakat di 82 tempat. Diantaranya‎‏ ‏fiman ‎Allah ta’ala,‎\n\nوَأَقِيمُواْ الصَّلاَةَ وَآتُواْ الزَّكَاةَ وَارْكَعُواْ مَعَ الرَّاكِعِينَ\n\nDan dirikanlah shalat, tunaikanlah zakat dan ruku’lah beserta orang-orang yang ruku‘. (QS. Al ‎Baqarah: 43)‎\n\nSehingga tidak mengherankan Abu Bakar as Shiddiq berkata, “Aku benar-benar akan memerangi ‎orang-orang yang memisahkan antara shalat dan zakat” [HR Bukhari(1399),Muslim(20)].‎\n\nZakat disyariatkan mulai tahun kedua hijriah.Kaum muslimin pun telah ijma’ tentang kewajiban ‎untuk menunaikannya.Zakat terkandung banyak sekali faedah dan manfaat, diantaranya ‎mensucikan harta dan jiwa, mengajarkan kasih sayang dan kepedulian terhadap sesama manusia, ‎dan masih banyak lagi."
  },
  {
    "id": 4,
    "name": "Puasa (Rukun Islam ke-4)",
    "arab": "الصَّوْمُ",
    "task": "Puasa ramadhan termasuk salah satu rukun Islam. Puasa ramadhan hukumnya wajib berdasar ‎dalil-dalil dari Al Qur’an dan As Sunnah serta ijma’ kaum muslimin. Allah berfirman, ‎\n\nيَا أَيُّهَا الَّذِينَ آمَنُواْ كُتِبَ عَلَيْكُمُ الصِّيَامُ كَمَا كُتِبَ عَلَى الَّذِينَ مِن قَبْلِكُمْ لَعَلَّكُمْ تَتَّقُونَ\n\n‎Hai orang-orang yang beriman, diwajibkan atas kamu berpuasa sebagaimana diwajibkan atas ‎orang-orang sebelum kamu agar kamu bertakwa. (QS al Baqarah: 183)‎\n\nDefinisi puasa secara bahasa artinya menahan. Secara istilah syara’ puasa adalah ibadah kepada Allah ‎ta’ala dengan menahan diri dari makan, minum, dan segala sesuatu yang membatalkannya sejak ‎terbit fajar sampai terbenam matahari [Syarhul Mumti’, 6/298‎]."
  },
  {
    "id": 5,
    "name": "Haji (Rukun Islam ke-5)",
    "arab": "الحَجُّ",
    "task": "Hukum dari haji adalah wajib dengan kesepakatan kaum muslimin dan termasuk salah satu rukun ‎islam, dan yang wajib adalah sekali sepanjang umur bagi orang yang mampu, serta fardhu kifayah bagi ‎kaum muslimin tiap tahunnya. Diantara dalil nash dari Al Qur’an adalah firman Allah ta’ala,‎\n\nوَلِلّهِ عَلَى النَّاسِ حِجُّ الْبَيْتِ مَنِ اسْتَطَاعَ إِلَيْهِ سَبِيلاً\n\nMengerjakan haji adalah kewajiban manusia terhadap Allah, yaitu (bagi) orang yang sanggup ‎mengadakan perjalanan ke Baitullah. (QS Al Imran: 97)‎\n\nAdapun dalil dari As Sunnah, Rasulullah shalallahu ‘alaihi wassalam bersabda, Islam dibangun atas ‎lima perkara: Syahadat bawasanya tida ada sesembahan yang haq kecuali Allah dan Muhammad ‎adalah utusan Allah, mendirikan shalat, membayar zakat, haji, dan puasa di bulan Ramadhan [‎HR Bukhari (8), Muslim (16) dari sahabat Ibnu Umar radhiyallahu ‘anhuma‎].‎"
  },
  {
    "id": 6,
    "name": "Iman Kepada Allah (1)",
    "arab": "الإيْمَانُ بِالله",
    "task": "Iman kepada Allah menjadi urutan pertama dan poin terpenting dalam Islam. Allah SWT maha besar, Dia pencipta semua yang ada di alam semesta ini. Dia pula yang menguasai segala isi alam semesta, akhirat, dan lainnya. Tidak ada Tuhan selain Allah SWT, hanya Allah yang maha Esa, tidak ada duanya.\n\nMeyakini Allah tidak hanya melalui kata-kata, tapi juga dibutuhkan bukti. Dari amal perbuatan, melaksanakan semua perintah-Nya dan menjauhi larangan-Nya. Semua makhluk diwajibkan menyembah Allah, tak hanya manusia semata, melainkan hewan, tumbuhan, jin, hingga malaikat."
  },
  {
    "id": 7,
    "name": "Iman Kepada Malaikat (2)",
    "arab": "الإيمان بالمَلَائِكَةِ",
    "task": "Allah dalam memberikan tugas untuk mengatur seluruh isi alam, melalui malaikat-malaikatnya. Beriman dan meyakini malaikat sebagai utusan Allah menjadi rukun iman kedua.\n\nPara malaikat bertugas sebagai perantara Allah juga tertuang pada Alquran surah An Nahl ayat 2, yang berarti “Allah menurunkan para malaikat untuk membawa wahyu dengan perintah-Nya kepada siapa yang Allah kehendaki di antara hamba-hamba-Nya, yaitu: “Peringatkanlah olehmu sekalian, bahwasanya tidak ada Tuhan (yang hak) melainkan Aku, maka hendaklah kamu bertakwa kepada-Ku”."
  },
  {
    "id": 8,
    "name": "Iman Kepada Kitab (3)",
    "arab": "الإيمان بالكُتُبِ السَّمَاوِيَّةِ",
    "task": "Allah menuliskan ajaran-Nya melalui perantara wahyu yang diturunkan lewat malaikat. Wahyu tersebut tertuang pada kitab-kitab ajaran Islam. Kitab itu diturunkan kepada para Rasul, untuk kemudian dilanjutkan ke seluruh umat Islam. Agar dapat diamalkan seluruh umat sampai kiamat kelak.\n\nKitab-kitab ini sebagai pedoman dan pegangan umat di kala para rasul sudah wafat. Dengan berpedoman teguh pada kitab-kitab Allah, niscaya manusia bisa selamat dari siksa api neraka. Segala pertanyaan dan aturan Islam sudah tertuang di dalam kitab-kitab Allah tersebut. Adapun kitab yang perlu diimanin oleh umat Islam terdiri 4 kitab."
  },
  {
    "id": 9,
    "name": "Iman Kepada Nabi & Rasul (4)",
    "arab": "الإيمان بالرُّسُلِ",
    "task": "Malaikat Jibril menyampaikan pada Nabi dan Rasul keempat kitab suci, yaitu Taurat, Zabur, Injil dan Al Quran. Kitab Taurat diturunkan pada Nabi Musa, kita Zabur kepada Nabi Daud, kitab Injil kepada Nabi Isa, dan terakhir kitab suci Alquran diturunkan kepada nabi sekaligus Rasul terakhir, yakni Muhammad SAW.\n\nUmat Islam mengimani bahwa ada 25 Nabi yang diyakini. Selain itu, nabi terakhir yang diyakini adalah Nabi Muhmmad SAW."
  },
  {
    "id": 10,
    "name": "Iman Kepada Hari Kiamat (5)",
    "arab": "الإيمان باليَوْمِ الآخِرِ",
    "task": "Umat Islam diwajibkan percaya akan adanya hari akhir atau yang sering disebut dengan kiamat. Di mana setiap harinya, waktu demi waktu, manusia sibuk berurusan dengan urusan dunia. Akhir perjalanan manusia bukanlah kematian, melainkan kiamat itu sendiri.\n\nDi hari akhir nanti, semua manusia akan dikumpulkan. Dibangkitkan bagi mereka yang telah mati. Segala amal perbuatan manusia ditimbang. Di manakah ia layak ditempatkan, surga atau neraka. Tak ada satu orang pun yang akan lolos dari 'timbangan' amal.\n\nMeyakini adanya hari kiamat, maka manusia bisa menjadi lebih baik, mengumpulkan banyak pahala, sebagai saku atau simpanan di hari akhir kelak. Juga, manusia dapat lebih berserah dan mendekatkan diri kepada Allah SWT."
  },
  {
    "id": 11,
    "name": "Iman Kepada Qada' & Qadar (6)",
    "arab": "الإيمان بالقَضَاءِ والقَدَرِ",
    "task": "Allah memiliki ketetapan, kehendak, dan keputusan atas semua makhluk ciptaan-Nya. Dua kata ini kerap disandingkan jadi satu, karena Qadha dan Qadar memang tidak bisa terpisahkan. Namun menurut arti dan maknanya, dua kata punya perbedaan.\n\nSeperti yang sudah tertuang pada Quran surah Al Hajj ayat 70, yang artinya: “Apakah kamu tidak mengetahui bahwa sesungguhnya Allah mengetahui apa saja yang ada di langit dan di bumi?, bahwasanya yang demikian itu terdapat dalam sebuah kitab (Lauh Mahfuzh). Sesungguhnya yang demikian itu amat mudah bagi Allah.”\n\n- Qadha.\n\nMenurut bahasa, Qadha berarti ketetapan. Sebelum manusia lahir dan sebelum dunia tercipta, Allah sudah punya ketetapan. Dia tuliskan pada kitab Lauh Mahfuz. Baik tentang hidup, kebaikan, keburukan, dan kematian.\n\n- Qadar.\n\nMenurut bahasa, Qadar berarti ketentuan atau kepastian Allah. Sementara berdasarkan istilah, Qadar berarti penentuan yang pasti dan sudah ditetapkan oleh Allah. Termasuk yang sedang terjadi, akan terjadi, dan belum terjadi.\n\nHubungan Qada dan Qadar tidak bisa dipisahkan, karena Qada merupakan rencana dan Qadar adalah perwujudan atau kenyataan. Dua kata ini juga dikenal sebagai takdir oleh Allah SWT."
  }
]